---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsConnectorIsprimary
source: html/e98d24a7-8159-fce0-ae8d-812f0c4a175f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsConnectorIsprimary Property

"Primary Connector"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsConnectorIsprimary { get; }
```